Performance Testing/Outputs (1 user)/output_20s.txt

          /\      |‾‾|  /‾‾/  /‾/   
     /\  /  \     |  |_/  /  / /    
    /  \/    \    |      |  /  ‾‾\  
   /          \   |  |‾\  \ | (_) | 
  / __________ \  |__|  \__\ \___/ .io

  execution: local
     output: -
     script: k6-script.js

    duration: 20s, iterations: -
         vus: 1,   max: 1

    init [----------------------------------------------------------] starting
    ✓ Response time is less than 200ms
    ✓ Content-Type is present
    ✓ Your test name
    ✓ Successful POST request
    ✓ Status code is 200

    checks.....................: 100.00% ✓ 8965 ✗ 0  
    data_received..............: 23 MB   1.1 MB/s
    data_sent..................: 817 kB  41 kB/s
    http_req_blocked...........: avg=539.41µs min=0s      med=953.45µs max=10.97ms  p(90)=998.3µs p(95)=1ms    
    http_req_connecting........: avg=490.11µs min=0s      med=0s       max=9.97ms   p(90)=998.1µs p(95)=1ms    
    http_req_duration..........: avg=2ms      min=0s      med=1.03ms   max=21.92ms  p(90)=2.99ms  p(95)=7.96ms 
    http_req_receiving.........: avg=85.46µs  min=0s      med=0s       max=1.06ms   p(90)=0s      p(95)=997.2µs
    http_req_sending...........: avg=47.09µs  min=0s      med=0s       max=1.99ms   p(90)=0s      p(95)=0s     
    http_req_tls_handshaking...: avg=0s       min=0s      med=0s       max=0s       p(90)=0s      p(95)=0s     
    http_req_waiting...........: avg=1.86ms   min=0s      med=1.01ms   max=20.92ms  p(90)=2.99ms  p(95)=7.01ms 
    http_reqs..................: 5766    288.292674/s
    iteration_duration.........: avg=62.44ms  min=51.86ms med=60.83ms  max=107.71ms p(90)=69.81ms p(95)=75.79ms
    iterations.................: 320     15.999593/s
    vus........................: 1       min=1  max=1
    vus_max....................: 1       min=1  max=1