Performance Testing/Outputs (1 user)/output_30s.txt

          /\      |‾‾|  /‾‾/  /‾/   
     /\  /  \     |  |_/  /  / /    
    /  \/    \    |      |  /  ‾‾\  
   /          \   |  |‾\  \ | (_) | 
  / __________ \  |__|  \__\ \___/ .io

  execution: local
     output: -
     script: k6-script.js

    duration: 30s, iterations: -
         vus: 1,   max: 1

    init [----------------------------------------------------------] starting
    ✓ Your test name
    ✓ Successful POST request
    ✓ Status code is 200
    ✓ Response time is less than 200ms
    ✓ Content-Type is present

    checks.....................: 100.00% ✓ 10297 ✗ 0  
    data_received..............: 26 MB   878 kB/s
    data_sent..................: 937 kB  31 kB/s
    http_req_blocked...........: avg=725.03µs min=0s      med=995.7µs max=74.8ms   p(90)=999.9µs  p(95)=1.99ms  
    http_req_connecting........: avg=655.66µs min=0s      med=989.1µs max=74.8ms   p(90)=998.9µs  p(95)=1.07ms  
    http_req_duration..........: avg=2.63ms   min=0s      med=1.99ms  max=45.87ms  p(90)=4.03ms   p(95)=9.02ms  
    http_req_receiving.........: avg=129.87µs min=0s      med=0s      max=2.99ms   p(90)=996.32µs p(95)=997.6µs 
    http_req_sending...........: avg=61.67µs  min=0s      med=0s      max=8.97ms   p(90)=0s       p(95)=995.3µs 
    http_req_tls_handshaking...: avg=0s       min=0s      med=0s      max=0s       p(90)=0s       p(95)=0s      
    http_req_waiting...........: avg=2.44ms   min=0s      med=1.04ms  max=45.87ms  p(90)=3.99ms   p(95)=8.97ms  
    http_reqs..................: 6619    220.630152/s
    iteration_duration.........: avg=81.45ms  min=53.83ms med=71.86ms max=457.82ms p(90)=106.71ms p(95)=121.96ms
    iterations.................: 367     12.233157/s
    vus........................: 1       min=1   max=1
    vus_max....................: 1       min=1   max=1